<a href="https://colab.research.google.com/github/jeffersonjpa/DataScienceStudies/blob/master/Exploratory_Data_Analysis_v2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>



# Estudos sobre Exploratory Data Analysis

In [0]:
import numpy as np
import pandas as pd
import os

In [0]:
DATA_DIR = 'sample_data/'
FILE_NAME = 'credit_card_default.csv'
data_path = os.path.join(DATA_DIR, FILE_NAME)
ccd = pd.read_csv(data_path, index_col="ID") #Usando o id do cliente como identificador
ccd.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
ID,,,,,,,,,,,,,,,,,,,,,
1,20000,2,2,1,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,1
2,120000,2,2,2,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
3,90000,2,2,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
4,50000,2,2,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
5,50000,1,2,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [0]:
ccd.shape #(30000, 24)

(30000, 24)

In [0]:
#Reduz os nomes das colunas para lower case
ccd.rename(columns=lambda x: x.lower(), inplace=True)

In [0]:
#Estatísticas da colunas education (lembrando que todas foram transforamdas em lower case)
ccd['education'].describe()

count    30000.000000
mean         1.853133
std          0.790349
min          0.000000
25%          1.000000
50%          2.000000
75%          2.000000
max          6.000000
Name: education, dtype: float64

In [0]:
bill_amt_features = ['bill_amt'+str(i) for i in range(1,7)]
pay_amt_features = ['pay_amt' +str(i) for i in range(1,7)] 
numerical_features = ['limit_bal', 'age'] + bill_amt_features + pay_amt_features

In [0]:
# bill_amt_features
# pay_amt_features
numerical_features

['limit_bal',
 'age',
 'bill_amt1',
 'bill_amt2',
 'bill_amt3',
 'bill_amt4',
 'bill_amt5',
 'bill_amt6',
 'pay_amt1',
 'pay_amt2',
 'pay_amt3',
 'pay_amt4',
 'pay_amt5',
 'pay_amt6']

In [0]:
ccd[bill_amt_features].describe().round()
# ccd[bill_amt_features].describe()

       bill_amt1  bill_amt2  bill_amt3  bill_amt4  bill_amt5  bill_amt6
count    30000.0    30000.0    30000.0    30000.0    30000.0    30000.0
mean     51223.0    49179.0    47013.0    43263.0    40311.0    38872.0
std      73636.0    71174.0    69349.0    64333.0    60797.0    59554.0
min    -165580.0   -69777.0  -157264.0  -170000.0   -81334.0  -339603.0
25%       3559.0     2985.0     2666.0     2327.0     1763.0     1256.0
50%      22382.0    21200.0    20088.0    19052.0    18104.0    17071.0
75%      67091.0    64006.0    60165.0    54506.0    50190.0    49198.0
max     964511.0   983931.0  1664089.0   891586.0   927171.0   961664.0

In [0]:
ccd['male'] = (ccd['sex'] == 1).astype('int')

In [0]:
ccd['male'].mean()

0.39626666666666666